{"config": [{"config": {"dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "use_bias": true, "padding": "valid", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [5, 5], "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 40, 40, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "use_bias": true, "padding": "valid", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 1000, "name": "dense_1", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 5, "name": "dense_2", "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}