{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 32, "kernel_size": [5, 5], "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_1", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "batch_input_shape": [null, 40, 40, 1], "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_2", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 1000, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null}}]}